#Задание 3.

#Узнайте у пользователя целое положительное число n.
#Найдите сумму чисел n + nn + nnn.

n = int(input("Введите число: "))
print(n,n + n,n + n + n)
