#Задание 1.

#Поработайте с переменными, создайте несколько,
#выведите на экран, запросите у пользователя несколько чисел и
#строк и сохраните в переменные, выведите на экран.

name = input("Введите ваше имя:")
pas = input("Введите ваш пароль:")
age = input("Введите ваш возраст:")
print(f"Ваши данные для входа в аккаунт: имя {name}, пароль {pas}, возраст")
