"""
Задание 3. Сформировать из введенного числа
обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
то надо вывести число 6843.
Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все цифры извлечены
Используем операции % //. Операции взятия по индексу применять нельзя.
Решите через рекурсию. В задании нельзя применять циклы.
Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321
Не забудьте проверить на числе, которое оканчивается на 0.
1230 -> 0321
"""


def num_rev(n, rev=0):
    if n == 0:
        return rev

    digit = n % 10
    n = n // 10
    rev = rev * 10 + digit

    return num_rev(n, rev)


n = int(input("Введите число, которое требуется перевернуть: "))
rev = num_rev(n)
print("Перевернутое число: ", rev)
